In [1]:
# import library
import pandas as pd

In [2]:
# import dataset
df = pd.read_csv('buying.csv')

In [7]:
# read a few lines of dataset
df.head()

  customer  apples  bananas
0     Jane       2        2
1   Daniel       1        5
2      May       4        1
3     Jack       3        0

In [9]:
df.head(3)

  customer  apples  bananas
0     Jane       2        2
1   Daniel       1        5
2      May       4        1

In [8]:
# read only apples column
df['apples']
# output: sekali index akan keluar automatically

0    2
1    1
2    4
3    3
Name: apples, dtype: int64